-- Добавление данных в таблицу "Студенты"
INSERT INTO Students (StudentID, FirstName, LastName, FacultyID, GPA)
VALUES (1, 'Иван', 'Иванов', 1, 4.5),
       (2, 'Мария', 'Петрова', 2, 3.8),
       (3, 'Алексей', 'Сидоров', 1, 4.2),
       (4, 'Елена', 'Козлова', 3, 3.9),
       (5, 'Сергей', 'Смирнов', 2, 4.1);

-- Добавление данных в таблицу "Факультеты"
INSERT INTO Faculties (FacultyID, FacultyName)
VALUES (1, 'Факультет информационных технологий'),
       (2, 'Факультет экономики'),
       (3, 'Факультет иностранных языков');

-- Добавление данных в таблицу "Дисциплины"
INSERT INTO Courses (CourseID, CourseName, Credits)
VALUES (1, 'Математика', 4),
       (2, 'Экономика', 3),
       (3, 'Английский язык', 2);

-- Добавление данных в таблицу "Студенты_Дисциплины"
INSERT INTO StudentCourses (StudentID, CourseID)
VALUES (1, 1),
       (1, 2),
       (2, 3),
       (3, 1),
       (4, 3);